In [2]:
import pandas as pd

pandas.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)
http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.melt.html#pandas.melt

In [14]:
df_melt=pd.DataFrame([['a',1,2],['b',1,3],['c',2,3]],columns=['A','B','C'])
df_melt

   A  B  C
0  a  1  2
1  b  1  3
2  c  2  3

In [15]:
df_melted=pd.melt(df_melt,id_vars='A',value_vars=['B','C'])
df_melted

   A variable  value
0  a        B      1
1  b        B      1
2  c        B      2
3  a        C      2
4  b        C      3
5  c        C      3

In [17]:
df_melt.columns=[list('ABC'),list('DEF')]
df_melt

   A  B  C
   D  E  F
0  a  1  2
1  b  1  3
2  c  2  3

In [32]:
df_melted1=pd.melt(df_melt, id_vars=[('A','D')],value_vars=[('B','E'),('C','F')])
df_melted1

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      1
2      c          B          E      2
3      a          C          F      2
4      b          C          F      3
5      c          C          F      3